Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: ?php $a = array( 1 = 'one', 2 = 'two', 3 = 'three'); unset($a[2]); / * will produce an array that would have been defined as $a = array(1 = 'one', 3 = 'three'); and NOT $a = array(1 = 'one', 2 = 'three'); * / $b = array_values($a); / / Now b is array(1 = 'one', 2 = 'three')?
pt_br: $a = array( 1 = 'um', 2 = 'dois', 3 = 'três '); unset ($a[2]); / * irá produzir um array que pode ser definido como $a = array (1= 'um', 3= 'três'); e NÃO $a = array (1 = 'um', 2 = 'três'); * /

source: The foreach control structure exists specifically for arrays.
pt_br: foreach foreach existe especificamente para lidar com arrays.

source: It provides an easy way to traverse an array.
pt_br: Ele provém uma maneira fácil de percorrer qualquer array.

source: You should always use quotes around an associative array index.
pt_br: Array: faça e não faça

source: For example, use $foo[ 'bar'] and not $foo[bar].
pt_br: Porque $foo[ bar] está errado?

source: You might have seen the following syntax in old scripts:
pt_br: Você sempre deve usar delimitadores em volta um índice de um array associativo.

source: ?php $foo[ bar] = 'enemy'; echo $foo[bar]; / / etc?
pt_br: Por exemplo, utilizar $foo[ 'bar'] e não $foo[bar].

source: More examples to demonstrate this fact:
pt_br: Mas porque $foo[ bar] está errado?

source: ?php / / Let' s show all errors error_reporting(E_ALL); $arr = array('fruit '= 'apple', 'veggie' = 'carrot'); / / Correct print $arr['fruit']; / / apple print $arr['veggie']; / / carrot / / Incorrect.
pt_br: $foo[ bar] = 'inimigo'; echo $foo[bar]; / / etc

source: This works but also throws a PHP error of / / level E_NOTICE because of an undefined constant named fruit / / / / Notice:
pt_br: Como explicado na seção sintaxe, a chave precisa estar entre colchetes ('[' e ']').

source: Use of undefined constant fruit - assumed 'fruit' in... print $arr[fruit]; / / apple / / Let's define a constant to demonstrate what's going on.
pt_br: Isto significa que você pode escrever coisas como isso:

source: Constants are not / / looked for within strings so no E_NOTICE error here print "Hello $arr[fruit]"; / / Hello apple / / With one exception, braces surrounding arrays within strings / / allows constants to be looked for print "Hello {$arr[fruit]}"; / / Hello carrot print "Hello {$arr['fruit']}"; / / Hello apple / / This will not work, results in a parse error such as: / / Parse error: parse error, expecting T_STRING 'or T_VARIABLE' or T_NUM_STRING '/ / This of course applies to using autoglobals in strings as well print "Hello $arr['fruit']"; print "Hello $_GET['foo']"; / / Concatenation is another option print "Hello". $arr['fruit']; / / Hello apple?
pt_br: echo $arr[ foo(true)];

source: By default, error_reporting is turned down to not show them.
pt_br: $error_descriptions[ E_ERROR] = "Um erro fatal ocorreu"; $error_descriptions[E_WARNING] = "O PHP emitiu um alarme"; $error_descriptions[E_NOTICE] = "Apenas um aviso informal";

source: That means that you can write things like this:
pt_br: $error_descriptions[ 1] = "Um erro fatal ocorreu"; $error_descriptions[2] = "O PHP emitiu um alarme"; $error_descriptions[8] = "Apenas um aviso informal";

source: ?php echo $arr[ somefunc($bar)];?
pt_br: Então, como é possível que $foo[ bar] funcione?

source: ?php $error_descriptions[ E_ERROR] = "A fatal error has occured"; $error_descriptions[E_WARNING] = "PHP issued a warning"; $error_descriptions[E_NOTICE] = "This is just an informal notice";?
pt_br: Funciona porque bar, na sintaxe onde é utilizada é esperada como uma expressão constante.

source: As we already explained in the above examples, $foo[ bar] still works but is wrong.
pt_br: O PHP, hoje, assume que você quer bar literalmente, como a string "bar", mas que você esqueceu de escrever os delimitadores.

source: It works, because bar is due to its syntax expected to be a constant expression.
pt_br: Então, porque isso é tão mal?

source: PHP now assumes that you meant bar literally, as the string "bar", but that you forgot to write the quotes.
pt_br: Se em algum ponto do futuro, o time do PHP quiser acrescentar outra constante ou palavra chave, você terá problemas.

source: For example, you already cannot use the words empty and default this way, since they are special reserved keywords.
pt_br: Por exemplo, se você já não pode utilizar as palavras empty e default dessa maneira, desde que elas são palavras reservadas especiais.

source: See the above examples for details on why as well as the section on variable parsing in strings.
pt_br: Quando você liga error_reporting em E_ALL, você irá ver as notícias que o PHP gera quando um índice é utilizado sem ser definido (coloque a linha error_reporting(E_ALL); em seu script).

source: For any of the types: integer, float, string, boolean and resource, if you convert a value to an array, you get an array with one element (with index 0), which is the scalar value you started with.
pt_br: Com string s delimitadas por aspas, uma outra sintaxe é válida.

source: If you convert an object If you convert an object to an array, you get the properties (member variables) of that object as the array's elements.
pt_br: Exemplos

source: If you convert a NULL value to an array, you get an empty array.
pt_br: O tipo array do PHP é muito versátil, por isso temos aqui alguns exemplos para mostrar todo o poder dos arrays.

source: ?php / / this $a = array( 'color '= 'red', 'taste' = 'sweet', 'shape '= 'round', 'name' = 'apple', 4 / / key will be 0); / / is completely equivalent with $a['color'] = 'red'; $a['taste'] = 'sweet'; $a['shape'] = 'round'; $a['name'] = 'apple'; $a[] = 4; / / key will be 0 $b[] = 'a'; $b[] = 'b'; $b[] = 'c'; / / will result in the array array(0 = 'a ', 1 = 'b', 2 = 'c'), / / or simply array('a', 'b', 'c')?
pt_br: / / isto $a = array( 'color '= 'vermelha', 'taste '= 'doce', 'shape '= 'redonda', 'name '= 'maçã', 4 / / a chave será 0); / / isto é equivalente a acima $a['cor'] = 'vermelha'; $a['sabor'] = 'doce'; $a['formato'] = 'redonda'; $a['nome'] = 'maçã'; $a[] = 4; / / a chave será 0 $b[] = 'a'; $b[] = 'b'; $b[] = 'c'; / / o mesmo de array (0 = 'a ', 1 = 'b', 2 = 'c '), / / ou simplesmente array('a', 'b', 'c')

source: Example 7-4.
pt_br: Exemplo 7-4.

source: Using array()
pt_br: Utilizando array()

source: ?php / / Array as (property -)map $map = array ('version '= 4, 'OS' = 'Linux', 'lang '= 'english', 'short_tags' = true); / / strictly numerical keys $array = array (7, 8, 0, 156, -10); / / this is the same as array(0 = 7, 1 = 8,...) $switching = array (10, / / key = 0 5 = 6, 3 = 7, 'a '= 4, 11, / / key = 6 (maximum of integer-indices was 5) '8' = 2, / / key = 8 (integer!) '02 '= 77, / / key = '02' 0 = 12 / / the value 10 will be overwritten by 12); / / empty array $empty = array();?
pt_br: / / Array como (propriedade -)mapa $map = array ('versão '= 4, 'OS' = 'Linux ', 'lang' = 'inglês ', 'short_tags' = true); / / apenas chaves numéricas $array = array (7, 8, 0, 156, -10); / / que é o mesmo que array (0 = 7, 1 = 8,...) $switching = array (10 / / chave = 0, 5 = 6, 3 = 7, 'a '= 4, 11 / / chave = 6 (o índice máximo era 5), '8' = 2 / / chave = 8 (inteiro!), '02 '= 77 / / chave = '02', 0 = 12 / / o valor 10 será sobrescrito por 12); / / array vazio $empty = array();

source: Example 7-5.
pt_br: Exemplo 7-5.

source: Collection
pt_br: Coleção

source: ?php $colors = array( 'red', 'blue', 'green', 'yellow'); foreach ($colors as $color) {echo "Do you like $color?\n";} / * output:
pt_br: $cores = array( 'vermelho' ,'azul' ,'verde' ,'amarelo'); foreach ($cores as $cor) {echo "Você gosta de $cor?\n";} / * saida:

source: Do you like red?
pt_br: Você gosta de vermelho?

source: Do you like blue?
pt_br: Você gosta de azul?

source: Do you like green?
pt_br: Você gosta de verde?

source: Do you like yellow? * /?
pt_br: Você gosta de amarelo? * /

source: Note that it is currently not possible to change the values of the array directly in such a loop.
pt_br: Note que atualmente não se pode mudar os valores de um array diretamente dentro de um loop.

source: A workaround is the following:
pt_br: Superar essa limitação é possível da seguinte forma:

source: Example 7-6.
pt_br: Exemplo 7-6.

source: ?php foreach ($colors as $key = $color) {/ / won't work: / /$color = strtoupper($color); / / works: $colors[$key] = strtoupper($color);} print_r($colors); / * output:
pt_br: foreach ($cores as $key = $cor) {/ / não funciona: / /$cor = strtoupper($cor); / /funciona: $cores[$key] = strtoupper($cor);} print_r($cores); / * saida:

source: Array ([0] = RED [1] = BLUE [2] = GREEN [3] = YELLOW) * /?
pt_br: Array ([0] = VERMELHO [1] = AZUL [2] = VERDE [3] = AMARELO) * /

source: This example creates a one-based array.
pt_br: Este exemplo cria um array na base 1.

source: Example 7-7.
pt_br: Exemplo 7-7.

source: One-based index
pt_br: Array baseado em 1

source: ?php $firstquarter = array( 1 = 'January', 'February', 'March'); print_r($firstquarter); / * output:
pt_br: $primeiroquarto = array( 1 = 'Janeiro', 'Fevereiro', 'Março'); print_r($primeiroquarto); / * saida:

source: Array ([1] = 'January '[2] = 'February' [3] = 'March ') * /
pt_br: Array ([1] = 'Janeiro '[2] = 'Fevereiro' [3] = 'Março ') * /

source: Example 7-8.
pt_br: Exemplo 7-8.

source: Filling an array
pt_br: Preenchendo um array real

source: / / fill an array with all items from a directory $handle = opendir( '.'); while ($file = readdir($handle)) {$files[] = $file;} closedir($handle);?
pt_br: / / preenchendo um array com todos os itens de um diretório $handle = opendir( '.'); while ($file = readdir($handle)) {$files[] = $file;} closedir($handle);

source: Arrays are ordered.
pt_br: Arrays são ordenados.

source: See the array functions section for more information.
pt_br: Você pode mudar sua ordem utilizando vários funções de ordenação.

source: You can count the number of items in an array using the count() function.
pt_br: Veja as funções de arrays para mais informações.

source: Example 7-9.
pt_br: Exemplo 7-9.

source: Sorting array
pt_br: Ordenando arrays

source: ?php sort( $files); print_r($files);?
pt_br: sort( $files); print_r($files);

source: Because the value of an array can be everything, it can also be another array.
pt_br: Porque o valor de um array pode ser qualquer coisa, isto pode ser outro array.

source: Example 7-10.
pt_br: Isto pode criar arrays recursivos e multidimensionais.

source: Recursive and multi-dimensional arrays
pt_br: Exemplo 7-10.

source: You should be aware, that array assignment always involves value copying.
pt_br: Arrays recursivos e multidimensionais

source: ?php $arr1 = array( 2, 3); $arr2 = $arr1; $arr2[] = 4; / / $arr2 is changed, / / $arr1 is still array(2,3) $arr3 = $arr1; $arr3[] = 4; / / now $arr1 and $arr3 are the same?
pt_br: $fruits = array ("frutas "= array ("a" = "laranja ", "b" = "banana ", "c" = "maçã "), "numeros" = array (1, 2, 3, 4, 5, 6), "buracos "= array ("primeiro", 5 = "segundo ", "terceiro"));

source: Objects
pt_br: Objetos

source: This is the easiest type.
pt_br: Booleanos

source: A boolean A boolean expresses a truth value.
pt_br: Umbooleano expressa um valor de verdade.

source: It can be either TRUE or FALSE.
pt_br: Ele pode ser TRUE ou FALSE.

source: The boolean type was introduced in PHP 4.
pt_br: O tipo booleano foi introduzido no PHP 4.

source: To specify a boolean literal, use either the keyword TRUE or FALSE.
pt_br: Para especificar um literal booleano, use as palavras chave TRUE ou FALSE.

source: Both are case-insensitive.
pt_br: Ambas são insensitivas ao caso.

source: ?php $foo = True; / / assign the value TRUE to $foo?
pt_br: $foo = True; / / assimila o valor TRUE para $foo

source: Usually you use some kind of operator which returns a boolean value, and then pass it on to a control structure.
pt_br: Usualmente você pode utilizar algum tipo de operador que retorne um valor booleano, e passá-lo para uma estrutura de controle.

source: ?php / / == is an operator which test / / equality and returns a boolean if ($action == "show_version") {echo "The version is 1.23";} / / this is not necessary... if ($show_separators == TRUE) {echo "hr \n";} / / ...because you can simply type if ($show_separators) {echo" hr \n";}?
pt_br: Convertendo para booleano

source: To explicitly convert a value to boolean, use either the (bool) or the (boolean) cast.
pt_br: Para converter explicitamente um valor para booleano, utilize-se dos modificadores (bool) ou (boolean).

source: See also Type Juggling.
pt_br: Entretanto, na maioria dos casos, você não precisa utilizar o modificador, desde que qualquer valor será convertido automaticamente se um operador, função ou estrutura de controle requerer um argumento booleano.

source: When converting to boolean, the following values are considered FALSE:
pt_br: Veja também Manipulação de tipos.

source: the integer 0 (zero)
pt_br: Quando convertendo para booleano, os seguintes valores são considerados FALSE:

source: the float 0.0 (zero)
pt_br: o booleano FALSE

source: the empty string, and the string "0"
pt_br: o inteiro 0 (zero)

source: an array with zero elements
pt_br: o ponto flutuante 0.0 (zero)

source: an object with zero member variables
pt_br: uma string vazia e a string "0"

source: the special type NULL (including unset variables)
pt_br: um array sem elementos

source: -1 is considered TRUE, like any other non-zero (whether negative or positive) number!
pt_br: o tipo especial NULL (incluindo variáveis não definidas)

source: ?php echo gettype( (bool) ""); / / bool(false) echo gettype((bool) 1); / / bool(true) echo gettype((bool) -2); / / bool(true) echo gettype((bool) "foo"); / / bool(true) echo gettype((bool) 2.3e5); / / bool(true) echo gettype((bool) array(12)); / / bool(true) echo gettype((bool) array()); / / bool(false)?
pt_br: -1 é considerado TRUE, como qualquer valor não zero (negativos ou positivos)!

source: Integers
pt_br: Inteiros

source: ?php $a = 1.234; $b = 1.2e3; $c = 7E-10;?
pt_br: Números de ponto flutuante (AKA "floats", "doubles "ou "números reais") podem ser especificados utilizando qualquer uma das sintaxes seguintes:

source: LNUM [0-9] + DNUM ([0-9]*[\ .]{LNUM}) _BAR_ ({LNUM}[\ .][0-9]*) EXPONENT_DNUM (({LNUM} _BAR_ {DNUM}) [eE][+ -]? {LNUM})
pt_br: $a = 1.234; $a = 1.2e3; $a = 7E-10;

source: Floating point precision
pt_br: Precisão de números de ponto flutuante

source: It is quite usual that simple decimal fractions like 0.1 or 0.7 cannot be converted into their internal binary counterparts without a little loss of precision.
pt_br: É sabido que frações simples como 0.1 ou 0.7 não podem ser convertidos em sua representação binária interna sem uma pequena perda de precisão.

source: This can lead to confusing results: for example, floor( (0.1+0.7)*10) will usually return 7 instead of the expected 8 as the result of the internal representation really being something like 7.9999999999....
pt_br: Isto pode causar erros confusos: por exemplo, floor( (0.1+0.7)*10) irá retornar 7 em vez do esperado 8, como resultado da representação interna realmente ser algo como 7.9999999999....

source: For instance, 1 / 3 in decimal form becomes 0.3333333....
pt_br: Isto está relacionado ao fato de que é impossível expressar, exatamente, algumas frações em notação decimal com um número finito de dígitos.

source: So never trust floating number results to the last digit and never compare floating point numbers for equality.
pt_br: Por exemplo, 1 / 3 na forma decimal se torna 0.3333333....

source: For information on when and how strings are converted to floats, see the section titled String conversion to numbers.
pt_br: Então, nunca confie em resultados com números de ponto flutuante até a última casa e nunca compare números de ponto flutuante em igualdades.

source: See the Converting to integer section for more information.
pt_br: Se você realmente precisar de alta precisão, você pode utilizar as funções matemáticas de precisão arbitrária ou as funções relacionadas ao gmp.

source: PHP supports eight primitive types.
pt_br: Capítulo 7.

source: Four scalar types:
pt_br: Tipos

source: integer
pt_br: Introdução

source: floating-point number (float)
pt_br: O PHP suporta os oitos tipos primitivos.

source: string
pt_br: São quatros tipos básicos:

source: array
pt_br: booleano

source: object
pt_br: inteiro

source: NULL
pt_br: número com ponto flutuante (float)

source: callback
pt_br: objeto

source: If you simply want a human-readable representation of the type for debugging, use gettype().
pt_br: O tipo da variável geralmente não é configurado pelo programador: isto é decidido em tempo de execução pelo PHP, dependendo do contexto no qual a variável é usada.

source: Some examples:
pt_br: Se você quiser checar o tipo e valor de uma certa expressão, utilize var_dump().

source: ?php $bool = TRUE; / / a boolean $str = "foo"; / / a string $int = 12; / / an integer echo gettype($bool); / / prints out "boolean "echo gettype($str); / / prints out "string" / / If this is an integer, increment it by four if (is_int($int)) {$int += 4;} / / If $bool is a string, print it out / / (does not print out anything) if (is_string($bool)) {echo "String: $bool";}?
pt_br: Para verificar por certos tipos, não use gettype(), mas sim as funções is_ type.

source: If you would like to force a variable to be converted to a certain type, you may either cast the variable or use the settype() function on it.
pt_br: Se você quiser forçar a conversão de uma variável para um certo tipo, você pode moldar (casting) a variável ou usar a função settype() nela.

source: Note that a variable may be evaluated with different values in certain situations, depending on what type it is at the time.
pt_br: Note que uma variável pode se comportar de maneiras diferentes em certas situações, dependendo de qual tipo ela é no momento.

source: For more information, see the section on Type Juggling.
pt_br: Para mais informações, veja a seção Manipulação de tipos.

source: Booleans
pt_br: Booleanos

source: An integer is a number of the set Z = {..., -2, -1, 0, 1, 2,...}.
pt_br: Um inteiro é um número do conjunto Z = {..., -2, -1, 0, 1, 2,...}.

source: See also:
pt_br: Veja também:

source: Arbitrary length integers and Floating point numbers
pt_br: Inteiros de tamanho arbitrário e Números de ponto flutuante

source: Integers can be specified in decimal (10-based), hexadecimal (16-based) or octal (8-based) notation, optionally preceded by a sign (- or +).
pt_br: Inteiros podem ser especificados em notação decimal (base 10), hexadecimal (base 16) ou octal (base 8), opcionalmente precedido de sinal (- ou +).

source: If you use the octal notation, you must precede the number with a 0 (zero), to use hexadecimal notation precede the number with 0x.
pt_br: Para utilizar a notação hexadecimal, preceda número com 0x.

source: Example 7-1.
pt_br: Exemplo 7-1.

source: Integer literals
pt_br: Literais inteiras

source: ?php $a = 1234; # decimal number $a = -123; # a negative number $a = 0123; # octal number (equivalent to 83 decimal) $a = 0x1A; # hexadecimal number (equivalent to 26 decimal)?
pt_br: $a = 1234; # número decimal $a = -123; # um número negativo $a = 0123; # número octal (equivalente a 83 em decimal) $a = 0x1A; # número hexadecimal (equivalente a 26 em decimal)

source: ?php decimal: [1-9][0-9]* _BAR_ 0 hexadecimal:
pt_br: Overflow de inteiros

source: 0[ 0-7] + integer: [+ -]?decimal _BAR_ [+ -]?hexadecimal _BAR_ [+ - ]?octal?
pt_br: Se você especifica um número além dos limites do tipo inteiro, ele será interpretado como um ponto flutuante.

source: If you specify a number beyond the bounds of the integer type, it will be interpreted as a float If you specify a number beyond the bounds of the integer type, it will be interpreted as a float instead.
pt_br: Assim, se você realizar uma operação que resulte em um número além dos limites do tipo inteiro, um ponto flutuante será retornado também.

source: ?php $large_number = 2147483647; var_dump($large_number); / / output: int(2147483647) $large_number = 2147483648; var_dump($large_number); / / output: float(2147483648) / / this goes also for hexadecimal specified integers: var_dump (0x80000000); / / output: float(2147483648) $million = 1000000; $large_number = 50000 * $million; var_dump($large_number); / / output: float(50000000000)?
pt_br: $numero_grande = 2147483647; var_dump($numero_grande); / / saida: int(2147483647) $numero_grande = 2147483648; var_dump($numero_grande); / / saida: float(2147483648) / / isto também é permitido para especificação de números hexadecimais: var_dump (0x80000000); / / saida: float(2147483648) $milhao = 1000000; $numero_grande = 50000 * $milhao; var_dump($numero_grande); / / saida: float(50000000000)

source: Unfortunately, there was a bug in PHP so that this does not always work correctly when there are negative numbers involved.
pt_br: Infelizmente, há um bug no PHP que faz que ele nem sempre trabalhe corretamente quando há números negativos envolvidos.

source: For example: when you do -50000 * $million, the result will be -429496728.
pt_br: Por exemplo, quando você faz -50000 * $milhao, o resultado será -429496728.

source: However, when both operands are positive there is no problem.
pt_br: Entretanto, quando ambos os operadores são positivos, isso não ocorre.

source: This is solved in PHP 4.1.0.
pt_br: Isto foi resolvido no PHP 4.1.0.

source: There is no integer division operator in PHP.
pt_br: Não há operador de divisão inteira no PHP.

source: 1 / 2 yields the float 0.5.
pt_br: 1 / 2 retorna o ponto flutuante 0.5.

source: You can cast the value to an integer to always round it downwards, or you can use the round() function.
pt_br: Convertendo para inteiro

source: ?php var_dump( 25 / 7); / / float(3.5714285714286) var_dump((int) (25 / 7)); / / int(3) var_dump(round(25 / 7)); / / float(4)?
pt_br: Para converter explicitamente um valor para inteiro, utilize-se dos modificadores (int) ou (integer).

source: However, in most cases you do not need to use the cast, since a value will be automatically converted if an operator, function or control structure requires an integer argument.
pt_br: Veja também Manipulação de tipos.

source: You can also convert a value to integer with the function intval().
pt_br: de booleanos

source: See also type-juggling.
pt_br: FALSE será retornado como 0 (zero), e TRUE como 1 (um).

source: FALSE will yield 0 (zero), and TRUE will yield 1 (one).
pt_br: De números de ponto flutuante

source: When converting from float to integer, the number will be rounded towards zero.
pt_br: Quando convertendo de números de ponto flutuante para inteiros, o número será truncado.

source: If the float is beyond the boundaries of integer (usually + / - 2.15e+9 = 2^31), the result is undefined, since the float hasn't got enough precision to give an exact integer result.
pt_br: Se o número convertido estiver além dos limites de um inteiro (usualmente + / - 2.15e+9 = 2^31), o resultado é indefinido, mesmo porque o ponto flutuante não tem a mesma precisão para fornecer um resultado inteiro exato.

source: No warning, not even a notice will be issued in this case!
pt_br: Não se preocupe, pois nenhum aviso será emitido neste caso!

source: Never cast an unknown fraction to integer, as this can sometimes lead to unexpected results.
pt_br: echo (int) ((0.1+0.7) * 10); / / imprime 7!

source: ?php echo (int) ((0.1+0.7) * 10); / / echoes 7!?
pt_br: Veja Conversão de strings

source: See String conversion to numbers
pt_br: De outros tipos

source: Behaviour of converting to integer is undefined for other types.
pt_br: O comportamento da conversão de um inteiro é indefinido de outros tipos.
